Simulación/fluid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "420";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
35666
(
(0.830002112094 -5.03236090772e-06 0)
(0.830019560145 -1.49219035537e-05 0)
(0.83005518963 -2.45022155553e-05 0)
(0.830107653344 -3.38159999519e-05 0)
(0.830174131803 -4.28869587814e-05 0)
(0.830252863899 -5.1726163049e-05 0)
(0.830342775911 -6.03365887234e-05 0)
(0.830442780475 -6.87140188266e-05 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.83 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    flapTop
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapBottom
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapSide
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
