Simulación/fluid/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "420";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
70777
(
0.000483070089662
-5.71171604543e-09
0.000483086424874
-1.63352055276e-08
0.000483112315771
-2.5890886889e-08
0.000483146807297
-3.44915154156e-08
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
108
(
-0.000483064377938
-0.000466802647784
-0.000451088347491
-0.000435903048547
-0.000421228942832
-0.000407048821683
-0.000393346055752
-0.000380104575507
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.000486274977543
0.000469916525703
0.000454118326438
0.000438859756273
0.000424121143568
0.000409883631933
0.000396129181827
0.000382840476949
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    flapTop
    {
        type            calculated;
        value           uniform 0;
    }
    flapBottom
    {
        type            calculated;
        value           uniform 0;
    }
    flapSide
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
