Simulación/fluid/0/pointDisplacement
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

f	12.0;
omeg #calc "2*degToRad(180.0)*$f";

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cylinder
    {
        type           rampAngularOscillatingDisplacement;
	axis		(0 0 1);
	origin		(0.03 0.03 0);
	angle0		0;
	amplitude	0.1745329;
	omega		$omeg;
        value          uniform (0 0 0);
    }
    flapTop
    {
        type            fixedValue;
        value           $internalField;
    }
    flapBottom
    {
        type            fixedValue;
        value           $internalField;
    }
    flapSide
    {
        type            fixedValue;
        value           $internalField;
    }
    
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
