Simulación/fluid/constant/dynamicMeshDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

solvers
(
	Deformacion
	{
	      	solver	displacementLaplacian;
	      	
	      	motionSolverLibs ("libfvMotionSolvers.so");
		displacementLaplacianCoeffs {  
		diffusivity quadratic inverseDistance 
		(
			flapTop
			flapBottom
			flapSide
			cylinder
		);
		}
	}
);

