Simulación/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    inlet
    {
        type            patch;
        nFaces          108;
        startFace       70777;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       70885;
    }
    top
    {
        type            patch;
        nFaces          277;
        startFace       71013;
    }
    bottom
    {
        type            patch;
        nFaces          277;
        startFace       71290;
    }
    flapTop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       71567;
    }
    flapBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       71687;
    }
    flapSide
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       71807;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          76;
        startFace       71809;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          35666;
        startFace       71885;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          35666;
        startFace       107551;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       143217;
    }
)

// ************************************************************************* //
